shaniadolphin/stm32/usbFirmwareUpgrade/Project/usb_Device_Firmware_Upgrade/inc/platform_config.h
/******************** (C) COPYRIGHT 2009 STMicroelectronics ********************
* File Name          : platform_config.h
* Author             : MCD Application Team
* Version            : V3.0.1
* Date               : 04/27/2009
* Description        : Evaluation board specific configuration file.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PLATFORM_CONFIG_H
#define __PLATFORM_CONFIG_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Uncomment the line corresponding to the STMicroelectronics evaluation board
   used to run the example */
#if !defined (USE_STM3210B_EVAL) &&  !defined (USE_STM3210E_EVAL)
 //#define USE_STM3210B_EVAL
 #define USE_STM3210E_EVAL
#endif

#define USE_WAITN

/* Define the STM32F10x hardware depending on the used evaluation board */
#ifdef USE_STM3210B_EVAL
  #define DFU_ENTER                 GPIOB  
  #define DFU_ENTER_PIN             GPIO_Pin_12
  #define RCC_APB2Periph_GPIO_DFU   RCC_APB2Periph_GPIOB
  #define USB_CHECK                 GPIOA  
  #define USB_CHECK_PIN             GPIO_Pin_15
  #define RCC_APB2Periph_GPIO_USB   RCC_APB2Periph_GPIOA	
  #define USB_DISCONNECT            GPIOB  
  #define USB_DISCONNECT_PIN        GPIO_Pin_3
  #define RCC_APB2Periph_GPIO_DISCONNECT      RCC_APB2Periph_GPIOB
#else /* USE_STM3210E_EVAL */
  #define DFU_ENTER                 GPIOB 
  #define DFU_ENTER_PIN             GPIO_Pin_12
  #define RCC_APB2Periph_GPIO_DFU   RCC_APB2Periph_GPIOB
  #define USB_DISCONNECT            GPIOB  
  #define USB_DISCONNECT_PIN        GPIO_Pin_3
  #define RCC_APB2Periph_GPIO_DISCONNECT      RCC_APB2Periph_GPIOB
#endif /* USE_STM3210B_EVAL */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

#endif /* __PLATFORM_CONFIG_H */

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
